ЛИС2/src/Documents/лис_АктОтбораПроб/лис_АктОтбораПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_АктОтбораПроб</name>
  <registerRecords>AccumulationRegister.лис_ОтобранныеПробы</registerRecords>
  <registerRecords>InformationRegister.лис_ОтборПроб</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПлана</name>
    <type>
      <types>DocumentRef.лис_ПланОтбораПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораПроб</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
      <types>CatalogRef.Водозаборы</types>
      <types>CatalogRef.СелитебныеЗоны</types>
      <types>CatalogRef.Скважины</types>
      <types>CatalogRef.СанитарноЗащитныеЗоны</types>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельОтбораПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборудованиеДляОтбораПроб</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияУсловияПроведенияАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияТранспортировкиИХраненияПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВодыПриОтборе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаВМестеОтбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативныеДокументы</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНД</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования1</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПолучил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтобралПробу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствовалПриОтбореПроб</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробуПринял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатНаружнегоОсмотраПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИДатаДоставкиВЛабораторию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пробы</name>
    <attributes>
      <name>ТочкаОтбораПробы</name>
      <type>
        <types>CatalogRef.ТочкиКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпределяемыйПоказатель</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕмкостиДляОтбораПроб</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеПринадлежности</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПробы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КонсервантыДляАнализа</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеРеактивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ШифрПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/Enums/РазделыУчетаЭкоаналитическогоКонтроля/РазделыУчетаЭкоаналитическогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыУчетаЭкоаналитическогоКонтроля</name>
  <enumValues>
    <name>ПромышленныеВыбросы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныйВоздух</name>
  </enumValues>
  <enumValues>
    <name>СточныеВоды</name>
  </enumValues>
  <enumValues>
    <name>ПриродныеВоды</name>
  </enumValues>
  <enumValues>
    <name>Почвы</name>
  </enumValues>
  <enumValues>
    <name>ДонныеОтложения</name>
  </enumValues>
  <enumValues>
    <name>ФизическиеФакторы</name>
  </enumValues>
  <enumValues>
    <name>АтмосферныеОсадки</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Documents/лис_АктОтбораПроб/ManagerModule.bsl
Функция ПечатьАктОтбораПроб(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_АктОтбораПроб_АктОтбораПроб";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_АктОтбораПроб.ПФ_MXL_АктОтбораПроб");
		
	Для каждого ТекущийОбъект из МассивОбъектов Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка
		Область = Макет.ПолучитьОбласть("ОбластьШапка");
		Область.Параметры.Заполнить(ТекущийОбъект);
		//Область.Параметры.АдресФилиала = ;
		ТабличныйДокумент.Вывести(Область);
		
		// Строки
		Для каждого Проба из ТекущийОбъект.Пробы Цикл
			
			Область = Макет.ПолучитьОбласть("ОбластьСтрока");
			Область.Параметры.Заполнить(Проба);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	    // Подвал
		Область = Макет.ПолучитьОбласть("ОбластьПодвал");
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции	

Функция ПечатьЖурналаОтбораПробВоды(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_АктОтбораПроб_ЖурналОтбораПробВоды";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробВоды");
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Шапка
	Область = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(Область);
	
	РазделыУчета = Новый Массив;
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.ПриродныеВоды);
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.СточныеВоды);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РазделыУчета", РазделыУчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	лис_АктОтбораПробПробы.Ссылка.ВремяИДатаДоставкиВЛабораторию КАК ДатаВремяПоступления,
	               |	лис_АктОтбораПробПробы.Ссылка.ДатаОтбора КАК ДатаВремяОтбора,
	               |	лис_АктОтбораПробПробы.Ссылка.Заказчик КАК ОрганизацияЗаказчик,
	               |	лис_АктОтбораПробПробы.Ссылка.ОтобралПробу КАК ПробуОтобрал,
	               |	лис_АктОтбораПробПробы.ТочкаОтбораПробы КАК ТочкиОтбора,
	               |	ВложенныйЗапрос.НомерПротоколаРезультатов,
	               |	ВложенныйЗапрос.ДатаВыдачи
	               |ИЗ
	               |	Документ.лис_АктОтбораПроб.Пробы КАК лис_АктОтбораПробПробы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПротоколАнализаСточныхВод.Ссылка КАК Ссылка,
	               |			ПротоколАнализаСточныхВод.НомерПротокола КАК НомерПротоколаРезультатов,
	               |			ПротоколАнализаСточныхВод.ДатаПротокола КАК ДатаВыдачи
	               |		ИЗ
	               |			Документ.ПротоколАнализаСточныхВод КАК ПротоколАнализаСточныхВод
	               |		ГДЕ
	               |			ПротоколАнализаСточныхВод.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО лис_АктОтбораПробПробы.Ссылка = ВложенныйЗапрос.Ссылка.лис_АктОтбора
	               |ГДЕ
	               |	лис_АктОтбораПробПробы.Ссылка.РазделУчета В(&РазделыУчета)";
	Результат = Запрос.Выполнить().Выгрузить();	
	
	// Строки
	Для каждого Проба из Результат Цикл
		
		Область = Макет.ПолучитьОбласть("ОбластьСтрока");
		Область.Параметры.Заполнить(Проба);
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция ПечатьЖурналаОтбораПробПочвы(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_АктОтбораПроб_ЖурналОтбораПробПочвы";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробПочвы");
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Шапка
	Область = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(Область);
	
	РазделыУчета = Новый Массив;
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.ДонныеОтложения);
	РазделыУчета.Добавить(Перечисления.РазделыУчетаЭкоаналитическогоКонтроля.Почвы);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РазделыУчета", РазделыУчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	лис_АктОтбораПробПробы.Ссылка.РегистрационныйНомерПробы КАК РегистрационныйНомер,
	               |	лис_АктОтбораПробПробы.Ссылка.Организация КАК Филиал,
	               |	лис_АктОтбораПробПробы.Ссылка.Номер КАК АктОтбора,
	               |	лис_АктОтбораПробПробы.Ссылка.ДатаОтбора КАК ДатаОтбора,
	               |	лис_АктОтбораПробПробы.ОпределяемыйПоказатель КАК Проба,
	               |	лис_АктОтбораПробПробы.ШифрПробы
	               |ИЗ
	               |	Документ.лис_АктОтбораПроб.Пробы КАК лис_АктОтбораПробПробы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПротоколАнализаПочвДонныхОтложений.Ссылка КАК Ссылка,
	               |			ПротоколАнализаПочвДонныхОтложений.НомерПротокола КАК НомерПротокола,
	               |			ПротоколАнализаПочвДонныхОтложений.ДатаПротокола КАК ДатаПротокола
	               |		ИЗ
	               |			Документ.ПротоколАнализаПочвДонныхОтложений КАК ПротоколАнализаПочвДонныхОтложений
	               |		ГДЕ
	               |			ПротоколАнализаПочвДонныхОтложений.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО лис_АктОтбораПробПробы.Ссылка = ВложенныйЗапрос.Ссылка.лис_АктОтбора
	               |ГДЕ
	               |	лис_АктОтбораПробПробы.Ссылка.РазделУчета В(&РазделыУчета)";
	Результат = Запрос.Выполнить().Выгрузить();	
	
	// Строки
	Для каждого Проба из Результат Цикл
		
		Область = Макет.ПолучитьОбласть("ОбластьСтрока");
		Область.Параметры.Заполнить(Проба);
		Область.Параметры.ВремяОтбора = Проба.ДатаОтбора;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции


// Формирует печатные формы
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОтбораПроб") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктОтбораПроб", "Акт отбора проб",
			ПечатьАктОтбораПроб(МассивОбъектов, ОбъектыПечати),, "Документ.лис_АктОтбораПроб.ПФ_MXL_АктОтбораПроб");
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОтбораПробВоды") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОтбораПробВоды", "Журнал отбора проб воды",
			ПечатьЖурналаОтбораПробВоды(МассивОбъектов, ОбъектыПечати),, "Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробВоды");
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОтбораПробПочвы") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОтбораПробПочвы", "Журнал отбора проб почвы",
			ПечатьЖурналаОтбораПробПочвы(МассивОбъектов, ОбъектыПечати),, "Документ.лис_АктОтбораПроб.ПФ_MXL_ЖурналОтбораПробПочвы");
		
	КонецЕсли; 
	
КонецПроцедуры
